DataProcessors/АР_ВыгрузкаПлощадейВExcel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>АР_ВыгрузкаПлощадейВExcel</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыАренды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этаж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомнатаНомерБТИ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПомещениеНомерБТИ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексПоБома</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/АР_УниверсальныйРегистр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_УниверсальныйРегистр</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АР_СвойстваУниверсальногоРегистра</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АР_СвойстваУниверсальногоРегистра</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/АР_ВыгрузкаПлощадейВExcel/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.ИК) Тогда
		Сообщить("Внимание! Необходимо указать объект недвижимости для отбора!");
		Возврат;
	КонецЕсли;
	
	Если Объект.ИК.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_УниверсальныйРегистр.Объект КАК ОбъектАренды,
		|	АР_УниверсальныйРегистр.ТипЗначения,
		|	АР_УниверсальныйРегистр.Значение
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.АР_УниверсальныйРегистр КАК АР_УниверсальныйРегистр
		|ГДЕ
		|	АР_УниверсальныйРегистр.ТипЗначения = &ТипЗначения
		|	И АР_УниверсальныйРегистр.Значение = &Значение
		|	И АР_УниверсальныйРегистр.Объект.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ОбъектАренды,
		|	ВЫБОР
		|		КОГДА ВТ.ОбъектАренды.ТипОбъекта = &Эт
		|			ТОГДА ВТ.ОбъектАренды.Ссылка
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ.ОбъектАренды.Родитель.ТипОбъекта = &Эт
		|					ТОГДА ВТ.ОбъектАренды.Родитель.Ссылка
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВТ.ОбъектАренды.Родитель.Родитель.ТипОбъекта = &Эт
		|							ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Ссылка
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.ТипОбъекта = &Эт
		|									ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Ссылка
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Эт
		|											ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Ссылка
		|										ИНАЧЕ ВЫБОР
		|												КОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Эт
		|													ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
		|												ИНАЧЕ ВЫБОР
		|														КОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Эт
		|															ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
		|													КОНЕЦ
		|											КОНЕЦ
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Этаж,
		|	ВТ.ОбъектАренды.ПомещениеНомерБТИ КАК ПомещениеНомерБТИ,
		|	ВТ.ОбъектАренды.КомнатаНомерБТИ КАК КомнатаНомерБТИ,
		|	ВТ.ОбъектАренды.Наименование КАК ИндексПоБома1,
		|	ВТ.ОбъектАренды.ТипОбъекта КАК ТипОбъекта,
		|	ВТ.ОбъектАренды.ОбщаяПлощадь КАК Площадь,
		|	ВЫБОР
		|		КОГДА ВТ.ОбъектАренды.ТипОбъекта = &Эт
		|			ТОГДА 2
		|		КОГДА ВТ.ОбъектАренды.ТипОбъекта = &Зд
		|			ТОГДА 1
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК ИндексТипа,
		|	ВЫБОР
		|		КОГДА ВТ.ОбъектАренды.ТипОбъекта = &Зд
		|			ТОГДА ВТ.ОбъектАренды.Ссылка
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ.ОбъектАренды.Родитель.ТипОбъекта = &Зд
		|					ТОГДА ВТ.ОбъектАренды.Родитель.Ссылка
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВТ.ОбъектАренды.Родитель.Родитель.ТипОбъекта = &Зд
		|							ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Ссылка
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.ТипОбъекта = &Зд
		|									ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Ссылка
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Зд
		|											ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Ссылка
		|										ИНАЧЕ ВЫБОР
		|												КОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Зд
		|													ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
		|												ИНАЧЕ ВЫБОР
		|														КОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Зд
		|															ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
		|													КОНЕЦ
		|											КОНЕЦ
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Здание,
		|	ВЫБОР
		|		КОГДА ВТ.ОбъектАренды.ТипОбъекта = &Пом
		|			ТОГДА ВТ.ОбъектАренды.Родитель
		|		ИНАЧЕ ВТ.ОбъектАренды.Наименование
		|	КОНЕЦ КАК ИндексПоБома
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	(ВТ.ОбъектАренды.ТипОбъекта = &Оф
		|			ИЛИ ВТ.ОбъектАренды.ТипОбъекта = &Пом)
		|	И ВТ.ОбъектАренды.ПомещениеНомерБТИ <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИндексТипа,
		|	Здание,
		|	Этаж,
		|	КомнатаНомерБТИ";
		
		Запрос.УстановитьПараметр("Пом", Справочники.АР_ТипыОбъектовАренды.Помещение);
		Запрос.УстановитьПараметр("Оф", Справочники.АР_ТипыОбъектовАренды.Офис);
		Запрос.УстановитьПараметр("Зд", Справочники.АР_ТипыОбъектовАренды.Здание);
		Запрос.УстановитьПараметр("Эт", Справочники.АР_ТипыОбъектовАренды.Этаж);
		Запрос.УстановитьПараметр("Значение", Объект.ИК);
		Запрос.УстановитьПараметр("ТипЗначения", ПланыВидовХарактеристик.АР_СвойстваУниверсальногоРегистра.ИмущественныйКомплекс);
		
		Элементы.ОбъектыАрендыЗдание.Видимость = Истина;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_УниверсальныйРегистр.Объект КАК ОбъектАренды,
		|	АР_УниверсальныйРегистр.ТипЗначения,
		|	АР_УниверсальныйРегистр.Значение
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.АР_УниверсальныйРегистр КАК АР_УниверсальныйРегистр
		|ГДЕ
		|	АР_УниверсальныйРегистр.ТипЗначения = &ТипЗначения
		|	И АР_УниверсальныйРегистр.Объект.ПометкаУдаления = ЛОЖЬ
		|	И АР_УниверсальныйРегистр.Значение = &Значение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ОбъектАренды,
		|	ВЫБОР
		|		КОГДА ВТ.ОбъектАренды.ТипОбъекта = &Эт
		|			ТОГДА ВТ.ОбъектАренды.Ссылка
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ.ОбъектАренды.Родитель.ТипОбъекта = &Эт
		|					ТОГДА ВТ.ОбъектАренды.Родитель.Ссылка
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВТ.ОбъектАренды.Родитель.Родитель.ТипОбъекта = &Эт
		|							ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Ссылка
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.ТипОбъекта = &Эт
		|									ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Ссылка
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Эт
		|											ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Ссылка
		|										ИНАЧЕ ВЫБОР
		|												КОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Эт
		|													ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
		|												ИНАЧЕ ВЫБОР
		|														КОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Эт
		|															ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
		|													КОНЕЦ
		|											КОНЕЦ
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Этаж,
		|	ВТ.ОбъектАренды.ПомещениеНомерБТИ КАК ПомещениеНомерБТИ,
		|	ВТ.ОбъектАренды.КомнатаНомерБТИ КАК КомнатаНомерБТИ,
		|	ВТ.ОбъектАренды.Наименование КАК ИндексПоБома1,
		|	ВТ.ОбъектАренды.ТипОбъекта КАК ТипОбъекта,
		|	ВТ.ОбъектАренды.ОбщаяПлощадь КАК Площадь,
		|	ВЫБОР
		|		КОГДА ВТ.ОбъектАренды.ТипОбъекта = &Эт
		|			ТОГДА 2
		|		КОГДА ВТ.ОбъектАренды.ТипОбъекта = &Зд
		|			ТОГДА 1
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК ИндексТипа,
		|	ВЫБОР
		|		КОГДА ВТ.ОбъектАренды.ТипОбъекта = &Зд
		|			ТОГДА ВТ.ОбъектАренды.Ссылка
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТ.ОбъектАренды.Родитель.ТипОбъекта = &Зд
		|					ТОГДА ВТ.ОбъектАренды.Родитель.Ссылка
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВТ.ОбъектАренды.Родитель.Родитель.ТипОбъекта = &Зд
		|							ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Ссылка
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.ТипОбъекта = &Зд
		|									ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Ссылка
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Зд
		|											ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Ссылка
		|										ИНАЧЕ ВЫБОР
		|												КОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Зд
		|													ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
		|												ИНАЧЕ ВЫБОР
		|														КОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ТипОбъекта = &Зд
		|															ТОГДА ВТ.ОбъектАренды.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Ссылка
		|													КОНЕЦ
		|											КОНЕЦ
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Здание,
		|	ВЫБОР
		|		КОГДА ВТ.ОбъектАренды.ТипОбъекта = &Пом
		|			ТОГДА ВТ.ОбъектАренды.Родитель
		|		ИНАЧЕ ВТ.ОбъектАренды.Наименование
		|	КОНЕЦ КАК ИндексПоБома
		|ПОМЕСТИТЬ ВТИтог
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	(ВТ.ОбъектАренды.ТипОбъекта = &Оф
		|			ИЛИ ВТ.ОбъектАренды.ТипОбъекта = &Пом)
		|			И ВТ.ОбъектАренды.ПомещениеНомерБТИ <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИтог.ОбъектАренды,
		|	ВТИтог.Этаж КАК Этаж,
		|	ВТИтог.ПомещениеНомерБТИ,
		|	ВТИтог.КомнатаНомерБТИ КАК КомнатаНомерБТИ,
		|	ВТИтог.ИндексПоБома1,
		|	ВТИтог.ТипОбъекта,
		|	ВТИтог.Площадь,
		|	ВТИтог.ИндексТипа,
		|	ВТИтог.Здание,
		|	ВТИтог.ИндексПоБома
		|ИЗ
		|	ВТИтог КАК ВТИтог
		|ГДЕ
		|	ВТИтог.Здание = &Здание
		|
		|УПОРЯДОЧИТЬ ПО
		|	Этаж,
		|	КомнатаНомерБТИ";
		
		Запрос.УстановитьПараметр("Здание", Объект.ИК);
		Запрос.УстановитьПараметр("Пом", Справочники.АР_ТипыОбъектовАренды.Помещение);
		Запрос.УстановитьПараметр("Оф", Справочники.АР_ТипыОбъектовАренды.Офис);
		Запрос.УстановитьПараметр("Зд", Справочники.АР_ТипыОбъектовАренды.Здание);
		Запрос.УстановитьПараметр("Эт", Справочники.АР_ТипыОбъектовАренды.Этаж);
		Запрос.УстановитьПараметр("Значение", Объект.ИК.Родитель);
		Запрос.УстановитьПараметр("ТипЗначения", ПланыВидовХарактеристик.АР_СвойстваУниверсальногоРегистра.ИмущественныйКомплекс);
		
		Элементы.ОбъектыАрендыЗдание.Видимость = Ложь;
	КонецЕсли;
	
	РЗ = Запрос.Выполнить().Выгрузить();
	
	Объект.ОбъектыАренды.Загрузить(РЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВExcel(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Сохранение; 
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = "Файл Excel (*,xls; *.xlsx)|*.xls; *.xlsx|";
	//+
	//"Файл Excel 2013 (*,xlsx)|*.xlsx|"; 
	ДиалогОткрытияФайла.Фильтр = Фильтр; 
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь; 
	ДиалогОткрытияФайла.Заголовок = "Выберите файл для сохранения бланка"; 
	
	ПутьКФайлу = "Выгрузка площадей объектов недвижимости из 1С по " + СтрЗаменить(СокрЛП(Объект.ИК), """", "") + " от " + Формат(ТекущаяДата(),"ДЛФ=Д");
	ДиалогОткрытияФайла.ПолноеИмяФайла = ПутьКФайлу;
	Если ДиалогОткрытияФайла.Выбрать() Тогда 
		ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла; 
		//Иначе
		//	ПутьКФайлу="";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ОбъектыАренды) Тогда
		ЗаполнитьНаСервере();
	КонецЕсли;
	
	ЗаписатьФайлСервер(ПутьКФайлу);
КонецПроцедуры

&НаСервере
Функция ДляИК()
	
	Если Объект.ИК.ТипОбъекта = Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции


&НаКлиенте
Процедура ЗаписатьФайлСервер(ПутьКФайлу)
	
	Эксель = Новый COMОбъект("Excel.Application");
	Книга = Эксель.WorkBooks().Add();
	
	Книга = Эксель.Application.Workbooks(1);
	Лист = Книга.WorkSheets(1); 
	Лист.Cells.Clear(); //ClearContents();
	
	
	
	Лист.Columns(2).ColumnWidth = 20;
	Лист.Columns(3).ColumnWidth = 15;
	Лист.Columns(4).ColumnWidth = 15;
	Лист.Columns(5).ColumnWidth = 15;
	Лист.Columns(6).ColumnWidth = 15;
	
	Если ДляИК() Тогда
		
		Ячейка =  Лист.Cells(3, 2);
		Ячейка.Value = "Здание";
		Ячейка.Borders.LineStyle = 1;
		Ячейка.Interior.Color = (244*256*256 + 236*256 + 197);
		Ячейка.WrapText = истина;
		Лист.Columns(7).ColumnWidth = 15;
		
		ПК = 2;
		ЭтоИК = Истина;
	Иначе
		ПК = 1;
		ЭтоИК = Ложь;
		
	КонецЕсли;
	
	Ячейка =  Лист.Cells(3, ПК+1);
	Ячейка.Value = "Этаж";
	Ячейка.Borders.LineStyle = 1;
	Ячейка.Interior.Color = (244*256*256 + 236*256 + 197);
	Ячейка.WrapText = истина;
	
	Ячейка =  Лист.Cells(3, ПК+2);
	Ячейка.Value = "№ помещения по БТИ";
	Ячейка.Borders.LineStyle = 1;
	Ячейка.Interior.Color = (244*256*256 + 236*256 + 197);
	Ячейка.WrapText = истина;
	
	Ячейка =  Лист.Cells(3, ПК+3);
	Ячейка.Value =  "№ комнаты по плану БТИ";
	Ячейка.Borders.LineStyle = 1;
	Ячейка.Interior.Color = (244*256*256 + 236*256 + 197);
	Ячейка.WrapText = истина;
	
	Ячейка =  Лист.Cells(3, ПК+4);
	Ячейка.Value = "Индекс офиса (помещения по БОМА)";
	Ячейка.Borders.LineStyle = 1;
	Ячейка.Interior.Color = (244*256*256 + 236*256 + 197);
	Ячейка.WrapText = истина;
	
	Ячейка =  Лист.Cells(3, ПК+5);
	Ячейка.Value = "Площадь";
	Ячейка.Borders.LineStyle = 1;
	Ячейка.Interior.Color = (244*256*256 + 236*256 + 197);
	Ячейка.WrapText = истина;
	
	Инд = 3;
	Для каждого Стр Из Объект.ОбъектыАренды Цикл
		
		Инд = Инд +	1;
		
		Если ЭтоИК Тогда
			Ячейка =  Лист.Cells(Инд, ПК);
			Ячейка.Value = Строка(Стр.Здание);
			Ячейка.Borders.LineStyle = 1;
			Ячейка.HorizontalAlignment = 2;
			Ячейка.WrapText = истина;
		КонецЕсли;
		
		Ячейка =  Лист.Cells(Инд, ПК+1);
		Ячейка.Value = Строка(Стр.Этаж);
		Ячейка.Borders.LineStyle = 1;
		Ячейка.HorizontalAlignment = 2;
		Ячейка.WrapText = истина;
		
		Ячейка =  Лист.Cells(Инд, ПК+2);
		Ячейка.Value = Стр.ПомещениеНомерБТИ;
		Ячейка.Borders.LineStyle = 1;
		Ячейка.HorizontalAlignment = 2;
		Ячейка.WrapText = истина;
		
		Ячейка =  Лист.Cells(Инд, ПК+3);
		Ячейка.Value = Стр.КомнатаНомерБТИ;
		Ячейка.Borders.LineStyle = 1;
		Ячейка.HorizontalAlignment = 2;
		Ячейка.WrapText = истина;
		
		Ячейка =  Лист.Cells(Инд, ПК+4);
		Ячейка.Value = Стр.ИндексПоБома;
		Ячейка.Borders.LineStyle = 1;
		Ячейка.HorizontalAlignment = 2;
		Ячейка.WrapText = истина;
		
		Ячейка =  Лист.Cells(Инд, ПК+5);
		Ячейка.Value = Стр.Площадь;
		Ячейка.Borders.LineStyle = 1;
		Ячейка.HorizontalAlignment = 2;
		Ячейка.WrapText = истина;
		
	КонецЦикла; 
	
	Попытка        
		Книга.SaveAs(ПутьКФайлу);  
		Сообщить("Файл успешно сохранен!");
	Исключение
		Сообщить(ОписаниеОшибки()+ "Файл не сохранен!");
	КонецПопытки;
	
	Эксель.Application.Quit();
	
КонецПроцедуры

&НаКлиенте
Процедура ИКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыВыбора = Новый Массив;//(Элемент.ПараметрыВыбора);
	
	ПараметрыФормы= 	ПолучитьОбъектыАренды();
	ФормаВыбора = ПолучитьФорму("Справочник.АР_ОбъектыАренды.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
	//Ф.Элементы.Объект.Отображение = ОтображениеТаблицы.Список; 
	ФормаВыбора.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	ФормаВыбора.открыть();
	
	ПараметрыВыбора = Новый Массив;//(Элемент.ПараметрыВыбора);
	
	НовыйПараметр = Новый ПараметрВыбора("ТипОбъекта", ПредопределенноеЗначение("Справочник.АР_ТипыОбъектовАренды.Здание"));
	ПараметрыВыбора.Добавить(НовыйПараметр);
	
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектыАренды()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_ОбъектыАренды.Ссылка
	|ИЗ
	|	Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	|ГДЕ
	|	(АР_ОбъектыАренды.ТипОбъекта = &ИК
	|			ИЛИ АР_ОбъектыАренды.ТипОбъекта = &Зд)";
	
	Запрос.УстановитьПараметр("Зд", Справочники.АР_ТипыОбъектовАренды.Здание);
	Запрос.УстановитьПараметр("ИК", Справочники.АР_ТипыОбъектовАренды.ИмущественныйКомплекс);
	
	РЗ = Запрос.Выполнить().Выбрать();
	
	М = Новый Массив;
	
	Пока РЗ.Следующий() Цикл
		М.Добавить(РЗ.Ссылка);
	КонецЦикла; 
	
	СЗ = Новый СписокЗначений;
	СЗ.ЗагрузитьЗначения(М);
	
	//Возврат СЗ;
	
	НастройкиКомп = Новый НастройкиКомпоновкиДанных;
	
	ОтборСписка = НастройкиКомп.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборСписка.ПравоеЗначение = СЗ;
	ОтборСписка.Использование = Истина;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКомп);
	//ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы); // Здесь устанавливается возможность выбора не только элементов, но групп
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Группы); // Здесь устанавливается возможность выбора не только элементов, но групп
	
	Возврат ПараметрыФормы;
	//ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
	//ОткрытьФорму("Справочник.АР_ОбъектыАренды.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
	
	
КонецФункции
